artifacts/packs/openfoam-ecm-standalone_lumped_external_compat_strict_debug_20260330_132430/cases/lumped_solid/0/jellyRoll/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/jellyRoll";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 313.15;

boundaryField
{
    jellyRoll_to_shell
    {
        type            compressible::ecmTemperatureRadCoupledMixed;
        value           uniform 313.15;
        Tnbr            T;
        qrNbr           none;
        qr              none;
        useImplicit     true;
        useDeltaH       false;
        kappaMethod     solidThermo;
    }
    jellyRoll_to_cap
    {
        type            compressible::ecmTemperatureRadCoupledMixed;
        value           uniform 313.15;
        Tnbr            T;
        qrNbr           none;
        qr              none;
        useImplicit     true;
        useDeltaH       false;
        kappaMethod     solidThermo;
    }
}

// ************************************************************************* //
